'use client';
import React from 'react';
import { useLanguage } from "../contexts/LanguageContext";

const UserAgreement = () => {
    const { t } = useLanguage();
    return (
        <div style={{maxWidth: '800px', margin: '0 auto', padding: '20px'}}>
            <h1>Пользовательское Соглашение</h1>

            <p>
                Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует отношения между TUO TUO KZ, TOO
                (далее tuotuo.kz или Администрация) с одной стороны и пользователем сайта с другой.
                Сайт tuotuo.kz не является средством массовой информации.
            </p>

            <p>
                Используя сайт, Вы соглашаетесь с условиями данного соглашения.
                Если Вы не согласны с условиями данного соглашения, не используйте сайт tuotuo.kz!
            </p>

            <h2>Права и обязанности сторон</h2>
            <h3>Пользователь имеет право:</h3>
            <ul>
                <li>осуществлять поиск информации на сайте</li>
                <li>получать информацию на сайте</li>
                <li>использовать информацию сайта в личных некоммерческих целях</li>
            </ul>

            <h3>Администрация имеет право:</h3>
            <ul>
                <li>по своему усмотрению и необходимости создавать, изменять, отменять правила</li>
                <li>ограничивать доступ к любой информации на сайте</li>
            </ul>

            <h3>Пользователь обязуется:</h3>
            <ul>
                <li>не нарушать работоспособность сайта</li>
                <li>не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с
                    Сайтом и его Сервисами
                </li>
            </ul>

            <h3>Администрация обязуется:</h3>
            <ul>
                <li>поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от
                    Администрации причинам.
                </li>
            </ul>

            <h2>Ответственность сторон</h2>
            <ul>
                <li>Администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами</li>
                <li>В случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное
                    бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а
                    также бесперебойную работу информационного ресурса
                </li>
            </ul>

            <h2>Условия действия Соглашения</h2>
            <ul>
                <li>Данное Соглашение вступает в силу при любом использовании данного сайта.</li>
                <li>Соглашение перестает действовать при появлении его новой версии.</li>
                <li>Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему
                    усмотрению.
                </li>
                <li>Администрация не оповещает пользователей об изменении в Соглашении.</li>
            </ul>
        </div>

    )
}
export default UserAgreement;